In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [50]:
df = pd.read_csv('data.csv')
df

   house size  house price
0          60          NaN
1          80          NaN
2         100        120.0
3         120          NaN
4         200        300.0
5         240          NaN

In [3]:
df.isnull()

   house size  house price
0       False        False
1       False         True
2       False        False
3       False         True
4       False         True
5       False        False

In [11]:
dec1 = df['house price'].isnull()
dec1

0    False
1     True
2    False
3     True
4     True
5    False
Name: house price, dtype: bool

In [5]:
df['house price'].isnull().sum()

3

In [14]:
df['house size'][dec1]

1     80
3    120
4    200
Name: house size, dtype: int64

In [17]:
df.notnull()

   house size  house price
0        True         True
1        True        False
2        True         True
3        True        False
4        True        False
5        True         True

In [18]:
df.dropna()

   house size  house price
0          60         80.0
2         100        120.0
5         240        200.0

In [20]:
df.dropna(axis='columns')

   house size
0          60
1          80
2         100
3         120
4         200
5         240

In [21]:
df.dropna(axis=1) # 1 means columns

   house size
0          60
1          80
2         100
3         120
4         200
5         240

In [31]:
df['house price'].isnull().any() # if any or atleast one is null then result is True

True

In [32]:
df['house price'].isnull().all() # if all are null then result is True

False

In [35]:
df.dropna(how='all')

   house size  house price
0          60         80.0
1          80          NaN
2         100        120.0
3         120          NaN
4         200          NaN
5         240        200.0

In [38]:
df.dropna(axis=1, how='all')

   house size  house price
0          60         80.0
1          80          NaN
2         100        120.0
3         120          NaN
4         200          NaN
5         240        200.0

In [39]:
df

   house size  house price
0          60         80.0
1          80          NaN
2         100        120.0
3         120          NaN
4         200          NaN
5         240        200.0

In [43]:
df.fillna(0) # called 0 padding

   house size  house price
0          60         80.0
1          80          0.0
2         100        120.0
3         120          0.0
4         200          0.0
5         240        200.0

In [46]:
df['house price'].fillna(0)

0     80.0
1      0.0
2    120.0
3      0.0
4      0.0
5    200.0
Name: house price, dtype: float64

In [44]:
df.fillna(-1)

   house size  house price
0          60         80.0
1          80         -1.0
2         100        120.0
3         120         -1.0
4         200         -1.0
5         240        200.0

In [51]:
df['house price'].fillna(method='ffill')

0      NaN
1      NaN
2    120.0
3    120.0
4    300.0
5    300.0
Name: house price, dtype: float64

In [52]:
df['house price'].fillna(method='bfill')

0    120.0
1    120.0
2    120.0
3    300.0
4    300.0
5      NaN
Name: house price, dtype: float64

In [54]:
data = pd.read_csv('ride_data.csv')
data

,Unnamed: 0,dur,staA_id,staA_name,staB_id,staB_name,veh_id,passen_type,passen_gender,travel_date,travel_id,veh_count
0,0,12 minutes,81,Berry St at 4th St,323,Broadway at Kearny,5480,2,Male,4/21/2017,16941,19
1,1,24 minutes,3,Powell St BART Station (Market St at 4th St),118,Eureka Valley Recreation Center,5193,2,Male,2/13/2020,7334,16
2,2,8 minutes,67,San Francisco Caltrain Station 2 (Townsend St...,23,The Embarcadero at Steuart St,3652,3,Male,6/25/2020,24934,27
3,3,4 minutes,16,Steuart St at Market St,28,The Embarcadero at Bryant St,1883,1,Male,10/8/2021,25532,27
4,4,11 minutes,22,Howard St at Beale St,350,8th St at Brannan St,4626,2,Male,12/14/2019,7385,29
...,...,...,...,...,...,...,...,...,...,...,...,...
25755,25755,11 minutes,15,San Francisco Ferry Building (Harry Bridges Pl...,34,Father Alfred E Boeddeker Park,5063,1,Male,1/24/2020,6015,8
25756,25756,10 minutes,15,San Francisco Ferry Building (Harry Bridges Pl...,34,Father Alfred E Boeddeker Park,5411,2,Male,7/19/2020,13437,25
25757,25757,14 minutes,15,San Francisco Ferry Building (Harry Bridges Pl...,42,San Francisco City Hall (Polk St at Grove St),5157,2,Male,11/6/2017,21163,38
25758,25758,14 minutes,15,San Francisco Ferry Building (Harry Bridges Pl...,42,San Francisco City Hall (Polk St at Grove St),4438,2,Male,2/23/2017,2598,25
25759,25759,29 minutes,16,Steuart St at Market St,115,Jackson Playground,1705,3,Male,5/25/2017,12320,20